# Part 1: Data Transformation with Pandas
Compute some transformations over the customers.csv dataset. Then, upload the resulting DataFrame and the Notebook in the proper format.

Submission format (CSV):
- Filename: GroupX_Assignment2_C1_Part1.csv
- Extension: CSV, separated by commas.
- Comment: The DataFrame must be stored without the index.

Submission format (Notebook):
- Filename: GroupX_Assignment2_C1_Part1.ipynb
- Extension: IPYNB

Grading criteria
- 100% - The submitted CSV file is identical to the solution CSV
- 50% - Just two of the transformed columns are identical to those in the solution CSV
- 25% - Just one of the transformed columns are identical to that in the solution CSV
- 0% - None of the transformed columns match the solution CSV
*NOTE: All submissions made in other formats than the presented here will score 0*

In [104]:
import pandas as pd
data = pd.read_csv("data/customers.csv")
data.head(10)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain
0,0,1985,Graduation,Married,70951.0,0,0,2013-05-04,66,239,...,554,254,87,54,1,3,4,9,1,0
1,1,1961,Graduation,Single,57091.0,0,0,2014-06-15,0,464,...,64,7,0,37,1,7,3,7,5,0
2,9,1975,Master,Single,46098.0,1,1,2012-08-18,86,57,...,27,0,0,36,4,3,2,2,8,0
3,13,1947,PhD,Widow,25358.0,0,1,2013-07-22,57,19,...,5,0,0,8,2,1,0,3,6,0
4,17,1971,PhD,Married,60491.0,0,1,2013-09-06,81,637,...,237,12,19,76,4,6,11,7,5,0
5,20,1965,2n Cycle,Married,46891.0,0,1,2013-09-01,91,43,...,23,29,15,61,1,2,1,4,4,0
6,22,1976,Graduation,Divorced,46310.0,1,0,2012-12-03,99,185,...,88,15,5,14,2,6,1,5,8,0
7,24,1960,Master,Together,17144.0,1,1,2014-02-15,96,18,...,19,0,2,6,5,3,0,4,7,0
8,25,1958,Graduation,Married,65148.0,0,1,2012-11-16,9,460,...,422,33,12,153,2,6,6,7,4,0
9,35,1987,Graduation,Married,25545.0,1,0,2012-09-08,35,32,...,64,16,12,85,3,2,2,3,6,0

In [5]:
print(data.shape)
data.info()

(2240, 21)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2206 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  Complain             2240 non-null   int64
dtypes: float64(1), int64(17), object(3)
memory usage: 367.6+ KB

In [11]:
data.describe()

,ID,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain
count,2240.000000,2240.000000,2206.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000
mean,5592.159821,1968.805804,52241.089755,0.444196,0.506250,49.109375,303.935714,26.302232,166.950000,37.525446,27.062946,44.021875,2.325000,4.084821,2.662054,5.790179,5.316518,0.009375
std,3246.662198,11.984069,25206.494033,0.538398,0.544538,28.962453,336.597393,39.773434,225.715373,54.628979,41.280498,52.167439,1.932238,2.778714,2.923101,3.250958,2.426645,0.096391
min,0.000000,1893.000000,1730.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2828.250000,1959.000000,35265.000000,0.000000,0.000000,24.000000,23.750000,1.000000,16.000000,3.000000,1.000000,9.000000,1.000000,2.000000,0.000000,3.000000,3.000000,0.000000
50%,5458.500000,1970.000000,51381.500000,0.000000,0.000000,49.000000,173.500000,8.000000,67.000000,12.000000,8.000000,24.000000,2.000000,4.000000,2.000000,5.000000,6.000000,0.000000
75%,8427.750000,1977.000000,68592.000000,1.000000,1.000000,74.000000,504.250000,33.000000,232.000000,50.000000,33.000000,56.000000,3.000000,6.000000,4.000000,8.000000,7.000000,0.000000
max,11191.000000,1996.000000,666666.000000,2.000000,2.000000,99.000000,1493.000000,199.000000,1725.000000,259.000000,263.000000,362.000000,15.000000,27.000000,28.000000,13.000000,20.000000,1.000000

# Question 1 - 20 Points
Complete the following transformations over the customers.csv dataset.
1. Impute missing values in Income with the mean value but given Education and Marital_Status.

In [105]:


for education in data['Education'].unique():
    for marital in data['Marital_Status'].unique():

        edu_filter = data['Education'] == education
        mar_filter = data['Marital_Status'] == marital
        filtered_df = data[edu_filter & mar_filter]

        filtered_mean = filtered_df.Income.mean()
        filtered_nulls = filtered_df.Income.isnull().sum()
        
        if filtered_nulls > 0 and filtered_mean > 0:
            data.loc[edu_filter & mar_filter, 'Income'] = data.loc[edu_filter & mar_filter, 'Income'].fillna(filtered_mean)
            print(education, marital, filtered_mean, filtered_nulls)

Graduation Married 50765.93224299065 5
Graduation Single 51409.151020408164 7
Graduation Together 55705.78445229682 3
Master Widow 58401.545454545456 1
Master Together 52156.10891089109 5
PhD Married 58200.25925925926 3
PhD Single 53314.614583333336 2
PhD Divorced 53047.25490196078 1
PhD Together 56095.09649122807 3
2n Cycle Married 46201.1 1
2n Cycle Single 53673.944444444445 1
2n Cycle Together 44480.32727272727 2

In [109]:
data[(data['ID'] == 5491)]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain,DaysSinceEnrollment,Genaration
1122,5491,1951,Master,Together,52156.108911,0,1,2013-04-11,70,172,...,0,15,4,6,1,5,7,0,1361,BabyBoomer

2. Create a new column named DaysSinceEnrollment calculated from Dt_Customer. This new column should contain the number of days since enrollment and must be of type int(int64 or int32). Take 2017-01-01 as a reference for the calculation. Hint: Use datetime and timedelta data types

In [106]:
data['DaysSinceEnrollment'] = (pd.to_datetime('2017-01-01', format="%Y-%m-%d") - pd.to_datetime(data['Dt_Customer'], format="%Y-%m-%d")).dt.days.astype('int32')
data.sort_values('ID', ascending=True)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain,DaysSinceEnrollment
0,0,1985,Graduation,Married,70951.0,0,0,2013-05-04,66,239,...,254,87,54,1,3,4,9,1,0,1338
1,1,1961,Graduation,Single,57091.0,0,0,2014-06-15,0,464,...,7,0,37,1,7,3,7,5,0,931
2,9,1975,Master,Single,46098.0,1,1,2012-08-18,86,57,...,0,0,36,4,3,2,2,8,0,1597
3,13,1947,PhD,Widow,25358.0,0,1,2013-07-22,57,19,...,0,0,8,2,1,0,3,6,0,1259
4,17,1971,PhD,Married,60491.0,0,1,2013-09-06,81,637,...,12,19,76,4,6,11,7,5,0,1213
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,11178,1972,Master,Single,42394.0,1,0,2014-03-23,69,15,...,0,1,4,1,1,0,3,7,0,1015
2236,11181,1949,PhD,Married,156924.0,0,0,2013-08-29,85,2,...,1,1,1,0,0,0,0,0,0,1221
2237,11187,1978,Basic,Single,26487.0,1,0,2013-05-20,23,2,...,12,14,23,3,2,1,3,5,0,1322
2238,11188,1957,Graduation,Together,26091.0,1,1,2014-02-25,84,15,...,8,17,20,3,2,1,3,5,0,1041
2239,11191,1986,Graduation,Divorced,41411.0,0,0,2013-12-07,11,37,...,11,3,18,1,2,1,4,6,0,1121

3. Create a new column called Generation with the following logic.
    1. If was born after 1981 (included) - Millenial
    1. If was born between 1965 (included) and 1981 - GenX
    1. If was born between 1946 (included) and 1965 - BabyBoomer
    1. If was born between 1928 (included) and 1946 - Silent
    1. If was born before 1928 - remove the row
    1. Sort the resulting DataFrame by ID, in descending order.

In [112]:

def get_generation(year):
    if year >= 1928 and year < 1946:
        return 'Silent'
    elif year >= 1946 and year < 1965:
        return 'BabyBoomer'
    elif year >= 1965 and year < 1981:
        return 'Gen X'
    elif year >= 1981:
        return 'Millenial'

data['Generation'] = data['Year_Birth'].apply(get_generation)
data.dropna(subset=['Generation'], inplace=True)
data.sort_values('ID', ascending=False, inplace=True)

4. Save the DataFrame and the Notebook and upload them in the proper format

In [113]:
data.to_csv("data/Group3_Assignment2_C1_Part1.csv", index=False)